#+STARTUP: hidestars
** general
#+BEGIN_SRC emacs-lisp
    (fset 'yes-or-no-p 'y-or-n-p)
    (setq ido-enable-flex-matching t)
    (setq ido-everywhere t)
    (ido-mode 1)
    (find-file-noselect "~/.emacs.d/myinit.org")
    (electric-pair-mode)

    (defalias 'list-buffers 'ibuffer)

    (global-linum-mode 1)
    (setq linum-format "%5d ")
    (global-hl-line-mode)

    ;;backup directory

    (set-face-attribute 'default nil :height 100)
    (set-fontset-font t 'hangul (font-spec :name "NanumGothicCoding"))

    (global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
    (global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
    (global-set-key (kbd "S-C-<down>") 'shrink-window)
    (global-set-key (kbd "S-C-<up>") 'enlarge-window)
    (global-set-key (kbd "C-x b") 'ibuffer)

    (global-set-key (kbd "C-x p") 'package-list-packages)

    (eval-after-load "Emacs-Lisp"
      (define-key emacs-lisp-mode-map (kbd "C-c C-b") 'eval-buffer))

    (set-fontset-font "fontset-default" '(#x1100 . #xffdc) '("MunanCoding" . "iso10646-1"))
    ;;;(setq face-font-rescale-alist '((".*MunanCoding.*" . 1.1)))

    (use-package hungry-delete
      :ensure t
      :config
      (global-hungry-delete-mode))
    (use-package beacon
      :ensure t
      :config
      (beacon-mode 1)
      (setq beacon-color "#666600")
      )
    (use-package paredit
      :ensure t)
  #+END_SRC

#+RESULTS:
=t
==t
=   
** ibuffer
#+BEGIN_SRC emacs-lisp
  (setq ibuffer-saved-filter-groups
            '(("home"
               ("emacs-config" (or (filename . ".emacs.d")
                                   (filename . "emacs-config")))
               ("org" (or (mode . org-mode)
                          (filename . "OrgMode")))
               ("help" (or (name . "\*Help\*"))))))
      (add-hook 'ibuffer-mode-hook
                '(lambda()
                   (ibuffer-switch-to-saved-filter-groups "home")))
#+END_SRC

   #+RESULTS:
   | lambda | nil | (ibuffer-switch-to-saved-filter-groups home) |
** neotree
#+BEGIN_SRC emacs-lisp
    (use-package neotree
      :ensure t)
    (setq neo-theme 'icons)
  ;;;(setq neo-theme (if window-system 'icons 'arrow))
  (global-set-key (kbd "C-x -") 'neotree-toggle)
  (setq inhibit-compacting-font-caches t)

  ;;;get rid of linum in NeoTree
  (defun my/neotree-hook (_unused)
    (linum-mode -1))
  (add-hook 'neo-after-create-hook 'my/neotree-hook)
   #+END_SRC

   #+RESULTS:
   | my/neotree-hook |
** python
#+BEGIN_SRC emacs-lisp
  ;;;(setq python-shell-interpreter "python3")
  (setq python-shell-completion-native-disabled-interpreters '("python"))     
#+END_SRC

   #+RESULTS:
   | python |

** elpy
#+BEGIN_SRC emacs-lisp
  (use-package elpy
               :ensure t
               :init(elpy-enable))
  (print "hello world!!!")
#+END_SRC

#+RESULTS:
: hello world!!!

